{
    "disease": [
      {
        "id": 0,
        "name": "Diabetes",
        "definition": "Diabetes is a chronic long-lasting health condition that affects how your body turns food into energy",
        "cause": "Overweight, obesity, and physical inactivity",
        "precaution": "Reduce your total carb intake, Exercise regularly, Quit smoking",
        "doctor_type": "General Practitioner and Endocrinologist.",
        "symptoms": "Hunger and fatigue, Peeing more often and being thirstier.",
        "cure": "There are some medicines that can help with diabetes. But there is no long term cure",
        "suggest_diagnosis": "Contact General Practitioner",
        "leads_to": "risk of heart disease, stroke, high blood pressure"
      },
      {
        "id": 1,
        "name": "Hypertension",
        "definition": "High blood pressure (hypertension) is a common condition in which the long-term force of the blood against your artery walls is high enough that it may eventually cause health problems, such as heart disease",
        "cause": "For most adults, there's no identifiable cause of high blood pressure. Some people have high blood pressure caused by an underlying condition." ,
        "precaution": "Be Physically Active, Eat a Healthy Diet, Keep Yourself at a Healthy Weight, Do Not Smoke, Get Enough Sleep, Limit How Much Alcohol You Drink",
        "doctor_type": "General Practitioner and Cardiologist.",
        "symptoms": "Severe headaches, Nosebleed, Fatigue or confusion, Vision problems, Chest pain, Difficulty breathing, Irregular heartbeat, Blood in the urine",
        "cure": "Hypertension is a chronic disease. It can be controlled with medication, but it cannot be cured. ",
        "suggest_diagnosis": "Contact General Practitioner",
        "leads_to": "Heart attack or stroke, Aneurysm, Heart failure, Weakened and narrowed blood vessels in your kidneys, Thickened, narrowed or torn blood vessels in the eyes, Metabolic syndrome, Trouble with memory or understanding, Dementia"
      },
      {
        "id": 2,
        "name": "Depression",
        "definition": "Depression is a mood disorder that causes a persistent feeling of sadness and loss of interest. Also called major depressive disorder or clinical depression, it affects how you feel, think and behave and can lead to a variety of emotional and physical problems.",
        "cause": " Depression is a complex disease. No one knows exactly what causes it, but it can happen for a variety of reasons. Some people have depression during a serious medical illness. Others may have depression with life changes such as a move or the death of a loved one. Still others have a family history of depression.",
        "precaution": "Take steps to control stress, to increase your resilience and boost your self-esteem, Reach out to family and friends, especially in times of crisis, to help you get through rough times, Get treatment at the earliest sign of a problem to help prevent depression from worsening, Consider getting long-term maintenance treatment to help prevent a relapse of symptoms.",
        "doctor_type": "Psychiatrist",
        "symptoms": "Feeling very sad, hopeless or worried, Not enjoying things that used to give you joy, Being easily irritated or frustrated, Changes in how much you sleep and eat, Having a difficult time concentrating or remembering things",
        "cure": "There’s no cure for depression, but you still have plenty of options for treatment, all of which can improve your symptoms and minimize their impact on your daily life. In most cases, the first step to treating depression involves therapy with a trained mental health professional. If you’d like to try medication for depression, most mental health professionals will recommend combining medication and therapy. That’s because medication doesn’t always address the underlying causes or triggers that contribute to depression symptoms. ",
        "suggest_diagnosis": "Contact Psychiatrist",
        "leads_to": "Alcoholism or Drug Dependency, Suicide, Serious (Additional) Health Issues, Relationship Trouble, Lack of Productivity."
      },
      {
        "id": 3,
        "name": "Schizophrenia",
        "definition": "Schizophrenia is a serious mental disorder in which people interpret reality abnormally. Schizophrenia may result in some combination of hallucinations, delusions, and extremely disordered thinking and behavior that impairs daily functioning, and can be disabling.",
        "cause": " The exact causes of schizophrenia are unknown. Research suggests a combination of physical, genetic, psychological and environmental factors can make a person more likely to develop the condition.",
        "precaution": "Avoiding social isolation, Trauma therapy, Mental health services support, Aim for 30 minutes of exercise",
        "doctor_type": "A psychiatrist experienced in treating schizophrenia usually guides treatment.",
        "symptoms": "Delusions, Hallucinations, Disorganized thinking (speech), Extremely disorganized or abnormal motor behavior, Reduced or lack of ability to function normally",
        "cure": "There are many effective treatments, best provided by a team. These include medication, psychotherapy, behavioral therapy, and social services, as well as tools to help you stay in school or keep working. ",
        "suggest_diagnosis": "Assessment by a specialist in mental health",
        "leads_to": "Suicide, suicide attempts and thoughts of suicide. Anxiety disorders and obsessive-compulsive disorder (OCD)"
      },
      {
        "id": 4,
        "name": "Anxiety",
        "definition": "Anxiety is a feeling of fear, dread, and uneasiness. It might cause you to sweat, feel restless and tense, and have a rapid heartbeat. It can be a normal reaction to stress.",
          "cause": "Research has suggested that the following may be a cause of anxiety: overactivity in special areas of the brain, an imbalance of the brain chemicals serotonin and noradrenaline, the genes you inherit from your parents, having a history of stressful or traumatic experiences, having a painful long-term health condition. But many people develop anxieties for no apparent reason.",
        "precaution": "Take care of your body by eating a well-balanced diet.  Limit alcohol, caffeine, and sugar consumption, Take time out for yourself every day. Keep an anxiety journal, Rank your anxiety on a 1-to-10 scale. Note the events during which you felt anxious and the thoughts going through your mind before and during the anxiety. Keep track of things that make you more anxious or less anxious",
        "doctor_type": "Psychiatrist",
        "symptoms": "Pounding or rapid heartbeat, unexplained aches and pains, dizziness, and shortness of breath",
        "cure": "Medication and talk therapy are commonly used to treat anxiety. Lifestyle changes, like getting enough sleep and regular exercise, can also help. ",
        "suggest_diagnosis": "Assessment by a specialist in mental health",
        "leads_to": "Depression (which often occurs with an anxiety disorder) or other mental health disorders. Substance misuse."
      },
      {
        "id": 5,
        "name": "Acne",
        "definition": "Acne is a common skin condition that affects most people at some point. It causes spots, oily skin and sometimes skin that's hot or painful to touch.",
        "cause": " Acne is caused when tiny holes in the skin, known as hair follicles, become blocked. Sebaceous glands are tiny glands found near the surface of your skin. The glands are attached to hair follicles, which are small holes in your skin that an individual hair grows out of. ",
        "precaution": "Exercise, Chill, Eat healthy, Stay hydrated, Keep your face clean, Moisturize, Use makeup sparingly, Watch what you put on your hair, Keep your hands off your face, Stay out of the sun",
        "doctor_type": "Dermatologists",
        "symptoms": "closed plugged pores), open plugged pores, Small red, tender bumps (papules), Pimples (pustules), which are papules with pus at their tips, Large, solid, painful lumps under the skin (nodules), Painful, pus-filled lumps under the skin (cystic lesions)",
        "cure": "Although acne can't be cured, it can be controlled with treatment. Several creams, lotions and gels for treating spots are available at pharmacies. If you develop acne, it's a good idea to speak to your pharmacist for advice. ",
        "suggest_diagnosis": "A simple visual inspection by your healthcare provider",
        "leads_to": "emotional distress and scar the skin"
      },
      {
        "id": 6,
        "name": "PCOD",
        "definition": "PCOD (Polycystic Ovarian Disease) is a condition where the ovaries release a lot of immature or partially-mature eggs which eventually turn into cysts. ",
        "cause": "The cause of PCOD is still unknown. However, the association of PCOD with low-grade inflammation, excess insulin, production of male hormones (Hyperandrogenism) in high quantity and genetics can be found. Also, early age of menarche, unhealthy lifestyle and pollution are some of the contributing factors of PCOD",
        "precaution": "Maintain a healthy weight, Limit carbohydrates, Be active",
        "doctor_type": "Gynecologist, Endocrinologist or Reproductive Endocrinologist",
        "symptoms": "Excess androgen, Polycystic ovaries, Irregular menstruation (Oligomenorrhea), Skipped or absence of menstruation (Amenorrhea), Heavy menstrual bleeding (Menorrhagia) ",
        "cure": "As of now, there is no permanent cure, but most women can lead relatively normal and active lives. This requires an active lifestyle and health management. ",
        "suggest_diagnosis": "Contact Gynecologist",
        "leads_to": " Mood swings, Negative social relationships, Low self-confidence, Negative self-image, Disruption of eating and sleep patterns, Low motivation"
      },
      {
        "id": 7,
        "name": "Hormonal imbalance",
        "definition": "Hormonal imbalances occur when there is too much or too little of a hormone in the bloodstream. Because of their essential role in the body, even slight hormonal imbalances can cause side effects throughout the body.",
        "cause": " Hormonal imbalances occur when there is too much or too little of a hormone in the bloodstream. Because of their essential role in the body, even slight hormonal imbalances can cause side effects throughout the body.",
        "precaution": "Eat enough protein at every meal, Engage in regular exercise, Maintain a moderate weight, Take care of your gut health, Lower your sugar intake, Try stress reduction techniques, Consume healthy fats, Get consistent, high quality sleep.",
        "doctor_type": "Endocrinologist.",
        "symptoms": "weight gain, a hump of fat between the shoulders, unexplained, and sometimes sudden, weight loss, fatigue, muscle weakness, muscle aches, tenderness, and stiffness, pain, stiffness, or swelling in your joints, increased or decreased heart rate, sweating, increased sensitivity to cold or heat, constipation or more frequent bowel movements, frequent urination, increased thirst, increased hunger, depression, nervousness, anxiety, or irritability, blurred vision, infertility, thinning hair or fine, brittle hair, dry skin, puffy face, rounded face, purple or pink stretch marks",
        "cure": "There are many natural ways to keep your hormones in check, such as enjoying a nutritious diet, getting regular sleep and exercise, and managing your stress levels",
        "suggest_diagnosis": "Contact Endocrinologist ",
        "leads_to": " weight loss or gain, constipation, diarrhea, sweating, hot flashes, exhaustion and/or fatigue, infertility, diabetes (type 1 and type 2), diabetes insipidus, hypothyroidism, or an underactive thyroid, hyperthyroidism, or an overactive thyroid, hyperfunctioning thyroid nodules, thyroiditis, hypogonadism, Cushing syndrome, or high levels of cortisol, congenital adrenal hyperplasia, which causes low levels of cortisol and aldosterone, Addison’s disease"
      },
      {
        "id": 8,
        "name": "Common cold",
        "definition": "The common cold is a viral infection of your nose and throat (upper respiratory tract). It's usually harmless, although it might not feel that way. Many types of viruses can cause a common cold.",
        "cause": "Although many types of viruses can cause a common cold, rhinoviruses are the most common cause. A cold virus enters your body through your mouth, eyes or nose.",
        "precaution": "Wash your hands, Disinfect your stuff, Cover your cough, Don't share drinking glasses or eating utensils with other family members, Stay away from people with colds, Take care of yourself.",
        "doctor_type": "Family practice physicians, pediatricians, and internists",
        "symptoms": "Runny or stuffy nose, Sore throat, Cough, Congestion, Slight body aches or a mild headache, Sneezing, Low-grade fever, Generally feeling unwell",
        "cure": "Most cases of the common cold get better without treatment, usually within a week to 10 days. But a cough may linger for a few more days. The best thing you can do is take care of yourself while your body heals",
        "suggest_diagnosis": "Family practice physicians, pediatricians, and internists",
        "leads_to": " swelling and pain (inflammation) and infection of the sinuses.A common cold can lead to other infections, including strep throat, pneumonia, and croup or bronchiolitis in children"
      },
      {
        "id": 9,
        "name": "Asthma",
        "definition": "Asthma is a chronic lung disease characterized by episodes of airway narrowing and obstruction, causing wheezing, coughing, chest tightness and shortness of breath.",
        "cause": " Airborne allergens, Respiratory infections, Air pollutants and irritants and nonsteroidal anti-inflammatory drugs can cause asthma.",
        "precaution": "Get vaccinated for influenza and pneumonia, Identify and avoid asthma triggers, Monitor your breathing, Identify and treat attacks early, Take your medication as prescribed",
        "doctor_type": "Allergists and Immunologists",
        "symptoms": "Shortness of breath, Chest tightness or pain, Wheezing when exhaling, which is a common sign of asthma in children, Trouble sleeping caused by shortness of breath, coughing or wheezing, Coughing or wheezing attacks that are worsened by a respiratory virus, such as a cold or the flu",
        "cure": "Treatment can help control the symptoms so you're able to live a normal, active life. Inhalers, which are devices that let you breathe in medicine, are the main treatment. Tablets and other treatments may also be needed if your asthma is severe.",
        "suggest_diagnosis": "Contact Allergist",
        "leads_to": "Pneumonia and other complications from common infections like the flu. Early delivery or the loss of a pregnancy. Permanently narrowed bronchial tubes in your lungs."
      },
      {
        "id": 10,
        "name": "Bipolar disorder",
        "definition": "Bipolar disorder, formerly known as manic depression, is a condition that affects your moods, which can swing from one extreme to another. People with bipolar disorder have periods or episodes of: depression and mania .",
        "cause": " Bipolar disorder appears to result from a combination of factors. Genetic factors, Biological traits, Environmental factors.",
        "precaution": "Put yourself on a strict schedule for healthy eating and sleeping, Do not use drugs or alcohol, try to practice mindfulness (being in the here and now) if you can",
        "doctor_type": "General Practitioner and Psychiatrist",
        "symptoms": "feeling sad, hopeless or irritable most of the time, lacking energy, difficulty concentrating and remembering things, loss of interest in everyday activities, feelings of emptiness or worthlessness, feelings of guilt and despair, feeling pessimistic about everything, self-doubt, being delusional, having hallucinations and disturbed or illogical thinking, lack of appetite, difficulty sleeping, waking up early, suicidal thoughts",
        "cure": "There is no cure for bipolar disorder, but through behavior therapy and the right combination of mood stabilizers and other bipolar medicines, most people with bipolar disorder can live normal, productive lives and control the illness.",
        "suggest_diagnosis": "Contact Psychiatrist",
        "leads_to": "When left untreated, the symptoms of Bipolar Disorder will often increase in severity and may lead to suicide; there is a high suicide rate for people with the disorder. "
      },
      {
        "id": 11,
        "name": "Lactose intolerance",
        "definition": "Lactose intolerance is a common digestive problem where the body is unable to digest lactose, a type of sugar mainly found in milk and dairy products",
        "cause": "Lactose intolerance occurs when your small intestine doesn't produce enough of an enzyme (lactase) to digest milk sugar (lactose).",
        "precaution": "Limit milk and other dairy products, Eat and drink lactose-reduced dairy products, Add a liquid or powder lactase enzyme to milk to break down the lactose.",
        "doctor_type": "General Practitioner",
        "symptoms": "Diarrhea, Nausea, and sometimes, vomiting, Stomach cramps, Bloating, Gas",
        "cure": "Most people are able to control their symptoms by making changes to their diet.",
        "suggest_diagnosis": "Contact General Practitioner",
        "leads_to": "If not managed properly, lactose intolerance may cause severe digestive problems."
      },
      {
        "id": 12,
        "name": "Thyroid",
        "definition": "Your thyroid creates and produces hormones that play a role in many different systems throughout your body. When your thyroid makes either too much or too little of these important hormones, it’s called a thyroid disease. There are several different types of thyroid disease, including hyperthyroidism, hypothyroidism, thyroiditis and Hashimoto’s thyroiditis.",
        "cause": "Radiation therapy, Medication, Autoimmune disease, Iodine deficiency, Pregnancy, Pituitary disorder",
        "precaution": "Getting enough sleep, Exercising regularly, Watching your diet, Getting tested regularly as directed by your healthcare provider",
        "doctor_type": "Thyroidologists",
        "symptoms": "Experiencing anxiety, irritability and nervousness, Having trouble sleeping, Losing weight, Having an enlarged thyroid gland or a goiter, Having muscle weakness and tremors, Experiencing irregular menstrual periods or having your menstrual cycle stop, Feeling sensitive to heat, Having vision problems or eye irritation, Gaining weight, Fatigue, Having frequent and heavy menstrual periods, Having dry and coarse hair",
        "cure": "Removing your thyroid through surgery or destroying your thyroid through medication will cure hyperthyroidism. However, once your thyroid is removed or destroyed, you'll need to take thyroid hormone replacement medications for the rest of your life.",
        "suggest_diagnosis": "Contact Thyroidologists",
        "leads_to": "obesity, joint pain, infertility and heart disease"
      }
    ],
    "falls": [
      {
        "id": 0,
        "name": "fall",
        "definition": "A simple thing can change your life—like tripping on a rug or slipping on a wet floor. If you fall, you could break a bone, like thousands of older men and women do each year. For older people, a break can be the start of more serious problems, such as a trip to the hospital, injury, or even disability.",
        "cause": "Many things can cause a fall. Your eyesight, hearing, and reflexes might not be as sharp as they were when you were younger. Diabetes, heart disease, or problems with your thyroid, nerves, feet, or blood vessels can affect your balance. Some medicines can cause you to feel dizzy or sleepy, making you more likely to fall. Other causes include safety hazards in the home or community environment. Scientists have linked several personal risk factors to falling, including muscle weakness, problems with balance and gait, and blood pressure that drops too much when you get up from lying down or sitting (called postural hypotension). Foot problems that cause pain and unsafe footwear, like backless shoes or high heels, can also increase your risk of falling. Confusion can sometimes lead to falls. For example, if you wake up in an unfamiliar environment, you might feel unsure of where you are. If you feel confused, wait for your mind to clear or until someone comes to help you before trying to get up and walk around.Some medications can increase a person's risk of falling because they cause side effects like dizziness or confusion. The more medications you take, the more likely you are to fall.",
        "precaution": "Stay physically active, Have your eyes and hearing tested, Find out about the side effects of any medicine you take, Get enough sleep, Limit the amount of alcohol you drink, Stand up slowly, Use an assistive device if you need help feeling steady when you walk, Be very careful when walking on wet or icy surfaces, Wear non-skid, rubber-soled, low-heeled shoes, or lace-up shoes with non-skid soles that fully support your feet, Always tell your doctor if you have fallen since your last checkup, even if you aren't hurt when you fall.",
        "doctor_type": "General physician",
        "symptoms": "Severe or lingering pain, Headaches, Obvious swelling, Ringing in the ears,Bruising, Loss of balance, Dizziness, Back pain, Stomach pain.",
        "cure": "Whether you are at home or somewhere else, a sudden fall can be startling and upsetting. If you do fall, stay as calm as possible. Take several deep breaths to try to relax. Remain still on the floor or ground for a few moments. This will help you get over the shock of falling. Decide if you are hurt before getting up. Getting up too quickly or in the wrong way could make an injury worse.If you think you can get up safely without help, roll over onto your side. Rest again while your body and blood pressure adjust. Slowly get up on your hands and knees, and crawl to a sturdy chair.Put your hands on the chair seat and slide one foot forward so that it is flat on the floor. Keep the other leg bent so the knee is on the floor. From this kneeling position, slowly rise and turn your body to sit in the chair. If you are hurt or cannot get up on your own, ask someone for help or call ambulance. If you are alone, try to get into a comfortable position and wait for help to arrive.Carrying a mobile or portable phone with you as you move about your house could make it easier to call someone if you need assistance. An emergency response system, which lets you push a button on a special necklace or bracelet to call for help, is another option.",
        "leads_to": "Head injuries, Shoulder injuries, Back and spinal cord injuries, Hip fractures, Knee injuries, Sprains and fractures, Broken bones, Neck injuries, Internal bleeding, Lacerations, Soft tissue damage."
      }
    ],
    "physical activity": [
      {
        "id": 0,
        "name": "physical activity",
        "type": "there are four types of exercise: endurance, strength, balance, and flexibility. Research has shown that it’s important to get all types of exercise.",
        "Endurance": "Endurance activities, often referred to as aerobic, increase your breathing and heart rates. For example Brisk walking or jogging, Yard work, Dancing, Swimming etc.",
        "Strength": "Strong muscles help you stay independent and make everyday activities feel easier, like getting up from a chair, climbing stairs, and carrying groceries. For example Lifting weights, Carrying groceries, Gripping a tennis ball, Overhead arm curl Arm curls",
        "Balance": "Balance exercises help prevent falls. Many lower-body strength exercises will improve your balance. For example Standing on one foot, The heel-to-toe walk and Standing from a seated position.",
        "Flexibility": "Stretching can improve your flexibility. Flexibility exercises include back stretching, inner thigh and ankle stretch and back of leg stretching.",
        "duration": "you should do at least 150 minutes a week of moderate-intensity aerobic exercise, like brisk walking or fast dancing. Being active at least three days a week is best.",
        "start": "To play it safe and reduce your risk of injury begin your exercise program slowly with low-intensity exercises.Warm up before exercising and cool down afterward.",
        "Benefits": "Keep and improve your strength so you can stay independent. Have more energy with reduced fatigue. Sleep better with reduced levels of stress and anxiety.",
        "Motivation": "Find simple ways to make exercise fun and enjoyable. Try to fit exercise into your day and maybe make it a social activity. Keep track of your exercise progress for extra motivation."
      }
    ]
  }
  